In [1]:
import pandas as pd
import os

In [4]:
os.getcwd()

'C:\\Users\\Angshuman'

In [5]:
os.chdir('F:\\Data Science\\Data')

In [38]:
df=pd.read_csv('practice.csv')

In [39]:
df.head()

        Company  Sales  value
0         Bosch    234     12
1  Schlumberger    346     15
2         Bosch   5637     23
3         Bosch   5389     24
4         Bosch   5628     45

        Company  Sales
0         Bosch    234
1  Schlumberger    346

In [48]:
df2=df.groupby('Company').sum()

In [49]:
df2.head()

              Sales  value
Company
Bosch         16888    104
Schlumberger  21518    298